app/views/events/new.html.erb


      <%= f.association :genre, collection: Genre.all %>
---
SELECT "genres".* FROM "genres"