app/controllers/events_controller.rb

SELECT "genres".* FROM "genres"
---
  def new
    @event = Event.new
    @genres = Genre.all.sort