app/controllers/events_controller.rb

  def create
    @event = Event.new(event_params)
    @genre = Genre.find(params[:event][:genre_id])
    @event.genre = @genre
    if @event.save
---
SELECT "genres".* FROM "genres" WHERE "genres"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]
INSERT INTO "events" ("title", "date", "details", "genre_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"